export const HttpErrorCode: { [key: number]: string } = {
  200: '成功',
  201: '已创建',
  202: '已接受',
  204: '无内容',

  400: '错误的请求',
  401: '未授权',
  403: '禁止访问',
  404: '未找到',
  405: '方法不允许',
  408: '请求超时',
  409: '冲突',
  410: '已删除',
  415: '不支持的媒体类型',
  422: '无法处理的实体',
  423: '已锁定',
  424: '失败的依赖',
  426: '需要升级',

  500: '服务器内部错误',
  501: '尚未实施',
  502: '网关错误',
  503: '服务不可用',
  504: '网关超时',
  505: 'HTTP版本不受支持',
}

export const ErrorCode: { [key: number]: string } = {
  20000: '成功',
  50000: '错误',

  40100: '您的登录信息已过期，请重新登录',
  40300: '禁止访问',
  40400: '未找到',
  40500: '方法不允许',
}

export const NoAuthErrorCode = [40100, 40300]
